Repository: wly-p/training-la
Catalog: Packages/History/Sources/HistoryPresentation/Localizable.xcstrings
Source language: zh_hant
Languages: en

# history.achievedCount %lld %lld
source: 達標 %lld / %lld 組
en: %lld / %lld sets met

# history.achievementRate
source: 達成率
en: Achievement

# history.byDate
source: 按日期
en: By Date

# history.byExercise
source: 按動作
en: By Exercise

# history.cancel
source: 取消
en: Cancel

# history.delete
source: 刪除
en: Delete

# history.deleteConfirm.message
source: 刪除後無法復原，這場的所有組都會一併移除。
en: This can't be undone — all sets in this workout will be removed.

# history.deleteConfirm.title
source: 刪除這場訓練紀錄？
en: Delete this workout?

# history.deleteWorkout
source: 刪除整場紀錄
en: Delete Workout

# history.done
source: 完成
en: Done

# history.edit
source: 編輯
en: Edit

# history.empty
source: 還沒有訓練紀錄
en: No workouts yet

# history.empty.hint
source: 完成一次訓練後會出現在這裡
en: Your workouts will appear here after you finish one.

# history.error
source: 出錯了
en: Something Went Wrong

# history.error.deleteFailed %@
source: 刪除失敗：%@
en: Delete failed: %@

# history.error.loadExerciseHistory %@
source: 讀取動作歷史失敗：%@
en: Failed to load exercise history: %@

# history.error.loadHistory %@
source: 讀取歷史失敗：%@
en: Failed to load history: %@

# history.error.loadWorkout %@
source: 讀取場次失敗：%@
en: Failed to load workout: %@

# history.error.saveFailed %@
source: 儲存失敗：%@
en: Save failed: %@

# history.exerciseCount %lld
source: %lld個動作
en: %lld exercises

# history.exerciseTrend.empty.message
source: 練過這個動作才會出現在這裡。
en: Train this exercise to see it here.

# history.exerciseTrend.empty.title
source: 還沒有紀錄
en: No records yet

# history.exerciseTrend.prLegend
source: 綠點 = 這次創新高
en: Green dot = new personal record

# history.exerciseTrend.section
source: 重量趨勢
en: Weight trend

# history.exerciseTrend.sessions %lld
source: 歷次紀錄 · %lld 場
en: History · %lld sessions

# history.freeTraining
source: 自由訓練
en: Free training

# history.minutes %lld
source: %lld 分鐘
en: %lld min

# history.minutesShort %lld
source: %lld分
en: %lld min

# history.monthCount %lld
source: %lld 次
en: %lld sessions

# history.monthDuration %lld %lld
source: 共 %lld 小時 %lld 分
en: %lld hr %lld min total

# history.ok
source: 好
en: OK

# history.reps
source: 次數
en: Reps

# history.search.placeholder
source: 搜尋排課名稱
en: Search by name

# history.setIndex %lld
source: 第%lld組
en: Set %lld

# history.setsCount %lld
source: %lld組
en: %lld sets

# history.setsSpaced %lld
source: %lld 組
en: %lld sets

# history.showAll
source: 全部展開
en: Show all

# history.showMore %lld
source: ⋯還有 %lld 組
en: ⋯%lld more sets

# history.status
source: 狀態
en: Status

# history.status.done
source: 完成
en: Done

# history.status.interrupted
source: 中斷
en: Stopped

# history.status.skipped
source: 跳過
en: Skipped

# history.target %@ %lld
source: 目標 %@×%lld
en: Target %@×%lld

# history.timesCount %lld
source: %lld 次
en: %lld times

# history.title
source: 歷史
en: History

# history.totalVolume
source: 總量
en: Total volume

# history.weight
source: 重量
en: Weight
